homework/Lab05-06/combustorSprayWallFilmReitzDiwakar/0/Ydefault.orig
/*--------------------------------*- C++ -*----------------------------------*\
 =========                |
 \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
  \    /   O peration     | Website:  https://openfoam.org
   \  /    A nd           | Version:  9                                     
    \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      Ydefault;
}
// ************************************************************************* //

dimensions          [0 0 0 0 0 0 0];

internalField       uniform 0;

boundaryField
{
    "(region0_to_wallFilmRegion_wallFilmFaces|back|sides|outlet)"
    {
        type                zeroGradient;
    }

    "(inlet|fuel_inlet)"
    {
        type                fixedValue;
        value               $internalField;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
