homework/Lab05-06/combustorSprayWallFilmReitzDiwakar/0/epsilon.orig
/*--------------------------------*- C++ -*----------------------------------*\
 =========                |
 \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
  \    /   O peration     | Website:  https://openfoam.org
   \  /    A nd           | Version:  9                                     
    \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 2;

boundaryField
{
    inlet
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.02;
        value           uniform 2;
    }

    outlet
    {
        type            zeroGradient;
    }

    fuel_inlet
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.02;
        value           uniform 2;
    }

    "(back|sides)"
    {
        type            epsilonWallFunction;
        value           uniform 2;
    }

    region0_to_wallFilmRegion_wallFilmFaces
    {
        type            epsilonWallFunction;
        value           uniform 2;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
