homework/Lab05-06/combustorSprayWallFilmReitzDiwakar/0/k.orig
/*--------------------------------*- C++ -*----------------------------------*\
 =========                |
 \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
  \    /   O peration     | Website:  https://openfoam.org
   \  /    A nd           | Version:  9                                     
    \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.375;

boundaryField
{
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        value           uniform 0.375;
    }

    outlet
    {
        type            zeroGradient;
    }

    fuel_inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        value           uniform 0.375;
    }

    "(back|sides)"
    {
        type            kqRWallFunction;
        value           uniform 0.375;
    }

    region0_to_wallFilmRegion_wallFilmFaces
    {
        type            kqRWallFunction;
        value           uniform 0.375;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
