homework/Lab05-06/combustorSprayWallFilmReitzDiwakar/0/nut.orig
/*--------------------------------*- C++ -*----------------------------------*\
 =========                |
 \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
  \    /   O peration     | Website:  https://openfoam.org
   \  /    A nd           | Version:  9                                     
    \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    outlet
    {
        type            calculated;
        value           uniform 0;
    }

    fuel_inlet
    {
        type            calculated;
        value           uniform 0;
    }

    "(back|sides)"
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    region0_to_wallFilmRegion_wallFilmFaces
    {
        type            nutkWallFunction;
        value           uniform 0;
    }


}

// ************************************************************************* //
