homework/Lab05-06/combustorSprayWallFilmReitzDiwakar/constant/surfaceFilmProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      SurfaceFilmProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceFilmModel    thermoSingleLayer;

regionName          wallFilmRegion;

viscosity
{
    model   Newtonian;
}

sigma       0.07;

deltaWet    1e-12;

hydrophilic no;

momentumTransport
{
    model   laminar;
    Cf      0.005;
}

forces
{
    thermocapillary;

    distributionContactAngle
    {
        Ccf             1;

        distribution
        {
            type            normal;
            normalDistribution
            {
                minValue        50;
                maxValue        100;
                expectation     75;
                variance        100;
            }
        }
    }
}

ejection
{
    curvatureSeparation
    {
        definedPatchRadii
        (
            ("region0_to_wallFilmRegion_wallFilmFaces" 0)
        );
    }


    drippingEjection
    {
        cloudName    reactingCloud1;
        deltaStable  0;

        particlesPerParcel 10.0;

        parcelDistribution
        {
            type         RosinRammler;
            RosinRammlerDistribution
            {
                minValue 1e-6;
                maxValue 1.5e-4;
                d        1.5e-4;
                n        3;
            }
        }
    }

}

upperSurfaceModels
{
    heatTransfer
    {
        model       constant;
        c0          1;
    }
}

lowerSurfaceModels
{
    heatTransfer
    {
        model       constant;
        c0          1;
    }
}
// ************************************************************************* //
