homework/Lab05-06/combustorSprayWallFilmReitzDiwakar/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
 =========                |
 \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
  \    /   O peration     | Website:  https://openfoam.org
   \  /    A nd           | Version:  9
    \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application         reactingFoam;

startFrom           startTime;

startTime           0;

stopAt              endTime;

endTime             0.1;

deltaT              5e-06;

writeControl        adjustableRunTime;

writeInterval       0.0025;

purgeWrite          0;

writeFormat         ascii;

writePrecision      6;

writeCompression    off;

timeFormat          general;

timePrecision       6;

runTimeModifiable   true;

adjustTimeStep      yes;

maxCo               1.0;

functions
{
    residuals
    {
      type      residuals;
      enabled   yes;
      fields    (p U k epsilon h);
      libs      ("libutilityFunctionObjects.so");
    }
}

// ************************************************************************* //
